cmsis-svd/cmsis-svd/data/Microchip/ATSAMS70N.svd
            <register>
               <name>USBHS_HSTPIP</name>
               <description>Host Pipe Register</description>
               <addressOffset>0x0041C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PEN0</name>
                     <description>Pipe 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN1</name>
                     <description>Pipe 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN2</name>
                     <description>Pipe 2 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN3</name>
                     <description>Pipe 3 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN4</name>
                     <description>Pipe 4 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN5</name>
                     <description>Pipe 5 Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN6</name>
                     <description>Pipe 6 Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN7</name>
                     <description>Pipe 7 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN8</name>
                     <description>Pipe 8 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST0</name>
                     <description>Pipe 0 Reset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST1</name>
                     <description>Pipe 1 Reset</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST2</name>
                     <description>Pipe 2 Reset</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST3</name>
                     <description>Pipe 3 Reset</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST4</name>
                     <description>Pipe 4 Reset</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST5</name>
                     <description>Pipe 5 Reset</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST6</name>
                     <description>Pipe 6 Reset</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST7</name>
                     <description>Pipe 7 Reset</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRST8</name>
                     <description>Pipe 8 Reset</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_HSTFNUM</name>
               <description>Host Frame Number Register</description>
               <addressOffset>0x0420</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MFNUM</name>
                     <description>Micro Frame Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FNUM</name>
                     <description>Frame Number</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>FLENHIGH</name>
                     <description>Frame Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_HSTADDR1</name>
               <description>Host Address 1 Register</description>
               <addressOffset>0x0424</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HSTADDRP0</name>
                     <description>USB Host Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HSTADDRP1</name>
                     <description>USB Host Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HSTADDRP2</name>
                     <description>USB Host Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HSTADDRP3</name>
                     <description>USB Host Address</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_HSTADDR2</name>
               <description>Host Address 2 Register</description>
               <addressOffset>0x0428</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HSTADDRP4</name>
                     <description>USB Host Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HSTADDRP5</name>
                     <description>USB Host Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HSTADDRP6</name>
                     <description>USB Host Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HSTADDRP7</name>
                     <description>USB Host Address</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_HSTADDR3</name>
               <description>Host Address 3 Register</description>
               <addressOffset>0x042C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HSTADDRP8</name>
                     <description>USB Host Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HSTADDRP9</name>
                     <description>USB Host Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPCFG[%s]</name>
               <description>Host Pipe Configuration Register (n = 0) 0</description>
               <addressOffset>0x500</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ALLOC</name>
                     <description>Pipe Memory Allocate</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PBK</name>
                     <description>Pipe Banks</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PBKSelect</name>
                        <enumeratedValue>
                           <name>_1_BANK</name>
                           <description>Single-bank pipe</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BANK</name>
                           <description>Double-bank pipe</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BANK</name>
                           <description>Triple-bank pipe</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PSIZE</name>
                     <description>Pipe Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PSIZESelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128_BYTE</name>
                           <description>128 bytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256_BYTE</name>
                           <description>256 bytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_BYTE</name>
                           <description>512 bytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024_BYTE</name>
                           <description>1024 bytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PTOKEN</name>
                     <description>Pipe Token</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PTOKENSelect</name>
                        <enumeratedValue>
                           <name>SETUP</name>
                           <description>SETUP</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>IN</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>OUT</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTOSW</name>
                     <description>Automatic Switch</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTYPE</name>
                     <description>Pipe Type</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PTYPESelect</name>
                        <enumeratedValue>
                           <name>CTRL</name>
                           <description>Control</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ISO</name>
                           <description>Isochronous</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLK</name>
                           <description>Bulk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTRPT</name>
                           <description>Interrupt</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PEPNUM</name>
                     <description>Pipe Endpoint Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>INTFRQ</name>
                     <description>Pipe Interrupt Request Frequency</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>USBHS_HSTPIPISR[%s]</name>
               <description>Host Pipe Status Register (n = 0) 0</description>
               <addressOffset>0x530</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXINI</name>
                     <description>Received IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTI</name>
                     <description>Transmitted OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPI</name>
                     <description>Transmitted SETUP Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERRI</name>
                     <description>Pipe Error Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDI</name>
                     <description>NAKed Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDI</name>
                     <description>Received STALLed Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETI</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PBYCT</name>
                     <description>Pipe Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
